# Pandas
- Python library for Data Analysis and Manipulation


## Why Pandas?
- provides ability to work with Tabular data.
- **Tabular Data** - data that is organized into tables having rows and cols

In [1]:
!pip install Pandas

Requirement already satisfied: Pandas in c:\users\asus\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\asus\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->Pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [4]:
b_series = pd.Series(book_title)

In [6]:
type(b_series)

pandas.core.series.Series

In [7]:
b_series

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [8]:
b_series[2]

'Python'

In [9]:
b_series[1:4]

1          Java
2        Python
3    JavaScript
dtype: object

In [10]:
b_series.index=['a','b','c','d']

In [16]:
b_series

*           C++
+          Java
-        Python
$    JavaScript
dtype: object

In [17]:
b_series['+':'-']

+      Java
-    Python
dtype: object

In [15]:
b_series.index=['*',"+",'-','$']

# DataFrame - Introduction
- 2D labelled array having index and columns.
- multiple series combined together to form a Dataframe.
- most widely used data structure in pandas

In [18]:
import numpy as np

In [19]:
df = pd.DataFrame(np.random.randint(1,20,(5,3)))

In [29]:
df

   Col1  Col2  Col3
A     8    14     5
B    15    19     9
C     9    13    13
D     8    14    19
E    14    18    11

In [21]:
df.columns=['Col1','Col2','Col3']

In [ ]:
df

In [24]:
df.index=['A','B','C','D',"E"]

In [31]:
df['Col2']['E']  #df[column][row]

18

In [49]:
df[['Col2','Col3']]

   Col2  Col3
A    14     5
B    19     9
C    13    13
D    14    19
E    18    11

In [51]:
df[['Col3','Col3']]

   Col3  Col3
A     5     5
B     9     9
C    13    13
D    19    19
E    11    11

In [38]:
df.shape

(5, 3)

In [40]:
df.head()

   Col1  Col2  Col3
A     8    14     5
B    15    19     9
C     9    13    13
D     8    14    19
E    14    18    11

In [42]:
df.tail(2)

   Col1  Col2  Col3
D     8    14    19
E    14    18    11

In [44]:
df.sample(3)

   Col1  Col2  Col3
D     8    14    19
A     8    14     5
B    15    19     9

In [52]:
df

   Col1  Col2  Col3
A     8    14     5
B    15    19     9
C     9    13    13
D     8    14    19
E    14    18    11

In [60]:
df['Col4']= df['Col1']+df['Col2'] #Adding new column

In [63]:
df

   Col1  Col2  Col3
A     8    14     5
B    15    19     9
C     9    13    13
D     8    14    19
E    14    18    11

In [58]:
df=df.drop('Col4',axis=1)

In [62]:
df.drop('Col4',axis=1,inplace=True)

In [78]:
df.iloc[0:2,1:3]

   Col2  Col3
A    14     5
B    19     9

In [75]:
df.loc['A':'B','Col2':'Col3']

   Col2  Col3
A    14     5
B    19     9